blog/24.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 3.2 The Environment Model of Evaluation
#+subtitle: 2023-12-25 Mon
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)

The notions of /frames/ and /environments/ are introduced.

Despite the switch to the environment model of evaluation, the rules
for evaluating a combination remain the same:

#+begin_quote
- To evaluate a combination:
  1. Evaluate the subexpression of the combination.
  2. Apply the value of the operator subexpression to the value of the
     operand subexpression. (p. 238)
#+end_quote

The environment model of evaluation changes, though, what it means to
apply a procedure.

#+begin_quote
The environment model of procedure application can be summarized by
two rules:

- A procedure object is applied to a set of arguments by constructing
  a frame, binding the formal parameters of the procedure to the
  arguments of the call, and then evaluating the body of the procedure
  in the context of the new environment constructed.  The new frame
  has as its enclosing environment the environment part of the
  procedure object being applied.

- A procedure is created by evaluating a ~lambda~ expression relative
  to a given environment.  The resulting procedure object is a pair
  consisting of the text of the ~lambda~ expression and a pointer to
  the environment in which the procedure was created. (p. 240)
#+end_quote
* Exercise 3.9
*Exercise*:

#+begin_quote
In section 1.2.1 we used the substitution model to analyze two
procedures for computing factorials, a recursive version

#+begin_src scheme
  (define (factorial n)
    (if (= n 1)
        1
        (* n (factorial (- n 1)))))
#+end_src

and an iterative version

#+begin_src scheme
  (define (factorial n)
    (fact-iter 1 1 n))

  (define (fact-iter product counter max-count)
    (if (> counter max-count)
        product
        (fact-iter (* counter product)
                   (+ counter 1)
                   max-count)))
#+end_src

Show the environment structures created by evaluating ~(factorial 6)~
using each version of the `factorial' procedure.
#+end_quote

*Answer*:

Recursive version:
#+begin_src
                    +------------------------------------------------------------------------------------+
          global -->|                                                                                    |
          env       +------------------------------------------------------------------------------------+
                      ^              ^              ^               ^               ^               ^
    (factorial 6)     |              |              |               |               |               |
                 +------+       +------+       +------+        +------+        +------+        +------+
            E1 ->| n: 6 |  E2 ->| n: 5 |  E3 ->| n: 4 |  E4 -->| n: 3 |   E5 ->| n: 2 |  E6 -->| n: 1 |
                 |      |       |      |       |      |        |      |        |      |        |      |
                 +------+       +------+       +------+        +------+        +------+        +------+
   (if (= n 1)
       1                           same           same           same            same             same
       (* n factorial (- n 1)))
#+end_src

Iterative version:

#+begin_src
                    +------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
          global -->|                                                                                                                                                                        |
          env       +------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
                      ^              ^                                  ^                     ^                     ^                     ^                      ^                      ^
    (factorial 6)     |              |                                  |                     |                     |                     |                      |                      |
                 +------+       +-------------+                    +-------------+       +-------------+       +-------------+       +--------------+       +--------------+       +--------------+
            E1 ->| n: 6 |  E2 ->| product: 1  |               E3 ->| product: 1  |  E4 ->| product: 2  |  E5 ->| product:  6 |  E6 ->| product:  24 |  E7 ->| product: 120 |  E8 ->| product: 720 |
                 |      |       | counter: 1  |                    | counter: 2  |       | counter: 3  |       | counter:  4 |       | counter:  5  |       | counter:  6  |       | counter:  7  |
                 |      |       | max-count: 6|                    | max-count: 6|       | max-count: 6|       | max-count: 6|       | max-count: 6 |       | max-count: 6 |       | max-count: 6 |
                 +------+       +-------------+                    +-------------+       +-------------+       +-------------+       +--------------+       +--------------+       +--------------+
        (fact-iter 1 1 n)       (if (> counter max-count)                same                  same                  same                  same                  same                  same
                                    product
                                    (fact-iter (* counter product)
                                               (+ counter 1)
                                               max-count))
#+end_src

