blog/24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-25 Mon 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 3.2 The Environment Model of Evaluation</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 3.2 The Environment Model of Evaluation
<br />
<span class="subtitle">2023-12-25 Mon</span>
</h1>
<p>
The notions of <i>frames</i> and <i>environments</i> are introduced.
</p>

<p>
Despite the switch to the environment model of evaluation, the rules
for evaluating a combination remain the same:
</p>

<blockquote>
<ul class="org-ul">
<li>To evaluate a combination:
<ol class="org-ol">
<li>Evaluate the subexpression of the combination.</li>
<li>Apply the value of the operator subexpression to the value of the
operand subexpression. (p. 238)</li>
</ol></li>
</ul>
</blockquote>

<p>
The environment model of evaluation changes, though, what it means to
apply a procedure.
</p>

<blockquote>
<p>
The environment model of procedure application can be summarized by
two rules:
</p>

<ul class="org-ul">
<li>A procedure object is applied to a set of arguments by constructing
a frame, binding the formal parameters of the procedure to the
arguments of the call, and then evaluating the body of the procedure
in the context of the new environment constructed.  The new frame
has as its enclosing environment the environment part of the
procedure object being applied.</li>

<li>A procedure is created by evaluating a <code>lambda</code> expression relative
to a given environment.  The resulting procedure object is a pair
consisting of the text of the <code>lambda</code> expression and a pointer to
the environment in which the procedure was created. (p. 240)</li>
</ul>
</blockquote>
<div id="outline-container-orge734bf0" class="outline-2">
<h2 id="orge734bf0">Exercise 3.9</h2>
<div class="outline-text-2" id="text-orge734bf0">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In section 1.2.1 we used the substitution model to analyze two
procedures for computing factorials, a recursive version
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (<span style="color: #531ab6;">if</span> (= n 1)
      1
      (* n (factorial (- n 1)))))
</pre>
</div>

<p>
and an iterative version
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">factorial</span> n)
  (fact-iter 1 1 n))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">fact-iter</span> product counter max-count)
  (<span style="color: #531ab6;">if</span> (&gt; counter max-count)
      product
      (fact-iter (* counter product)
                 (+ counter 1)
                 max-count)))
</pre>
</div>

<p>
Show the environment structures created by evaluating <code>(factorial 6)</code>
using each version of the `factorial' procedure.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Recursive version:
</p>
<pre class="example">
                 +------------------------------------------------------------------------------------+
       global --&gt;|                                                                                    |
       env       +------------------------------------------------------------------------------------+
                   ^              ^              ^               ^               ^               ^
 (factorial 6)     |              |              |               |               |               |
              +------+       +------+       +------+        +------+        +------+        +------+
         E1 -&gt;| n: 6 |  E2 -&gt;| n: 5 |  E3 -&gt;| n: 4 |  E4 --&gt;| n: 3 |   E5 -&gt;| n: 2 |  E6 --&gt;| n: 1 |
              |      |       |      |       |      |        |      |        |      |        |      |
              +------+       +------+       +------+        +------+        +------+        +------+
(if (= n 1)
    1                           same           same           same            same             same
    (* n factorial (- n 1)))
</pre>

<p>
Iterative version:
</p>

<pre class="example">
                +------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
      global --&gt;|                                                                                                                                                                        |
      env       +------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
                  ^              ^                                  ^                     ^                     ^                     ^                      ^                      ^
(factorial 6)     |              |                                  |                     |                     |                     |                      |                      |
             +------+       +-------------+                    +-------------+       +-------------+       +-------------+       +--------------+       +--------------+       +--------------+
        E1 -&gt;| n: 6 |  E2 -&gt;| product: 1  |               E3 -&gt;| product: 1  |  E4 -&gt;| product: 2  |  E5 -&gt;| product:  6 |  E6 -&gt;| product:  24 |  E7 -&gt;| product: 120 |  E8 -&gt;| product: 720 |
             |      |       | counter: 1  |                    | counter: 2  |       | counter: 3  |       | counter:  4 |       | counter:  5  |       | counter:  6  |       | counter:  7  |
             |      |       | max-count: 6|                    | max-count: 6|       | max-count: 6|       | max-count: 6|       | max-count: 6 |       | max-count: 6 |       | max-count: 6 |
             +------+       +-------------+                    +-------------+       +-------------+       +-------------+       +--------------+       +--------------+       +--------------+
    (fact-iter 1 1 n)       (if (&gt; counter max-count)                same                  same                  same                  same                  same                  same
                                product
                                (fact-iter (* counter product)
                                           (+ counter 1)
                                           max-count))
</pre>
</div>
</div>
