blog/24.html

<div id="outline-container-org8a9eae4" class="outline-2">
<h2 id="org8a9eae4">Exercise 3.10</h2>
<div class="outline-text-2" id="text-org8a9eae4">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In the <code>make-withdraw</code> procedure, the local variable <code>balance</code> is
created as a parameter of <code>make-withdraw</code>.  We could also create the
local state variable explicitly, using <code>let</code>, as follows:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-withdraw</span> initial-amount)
  (<span style="color: #531ab6;">let</span> ((balance initial-amount))
    (<span style="color: #531ab6;">lambda</span> (amount)
      (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
          (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
                 balance)
          <span style="color: #3548cf;">"Insufficient funds"</span>))))
</pre>
</div>

<p>
Recall from section 1.3.2 that <code>let</code> is simply syntactic sugar for
a procedure call:
</p>

<pre class="example">
(let ((&lt;VAR&gt; &lt;EXP&gt;)) &lt;BODY&gt;)
</pre>

<p>
is interpreted as an alternate syntax for
</p>

<pre class="example">
((lambda (&lt;VAR&gt;) &lt;BODY&gt;) &lt;EXP&gt;)
</pre>

<p>
Use the environment model to analyze this alternate version of
<code>make-withdraw</code>, drawing figures like the ones above to illustrate the
interactions
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">W1</span> (make-withdraw 100))

(W1 50)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">W2</span> (make-withdraw 100))
</pre>
</div>

<p>
Show that the two versions of <code>make-withdraw</code> create objects with the
same behavior.  How do the environment structures differ for the two
versions?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Environments created by evaluating <code>(define w1 (make-withdraw 100))</code>:
</p>
<pre class="example">
GLOBAL ENV
+---------------------------------------------------------------------------------------------------------+
| make-withdraw:---+                   w1:---+                                                            |
|                  |                         |                                                            |
|                  |                         |                                                            |
|                  |            +------------+                                                            |
|                  |            |                                                                         |
|                  |            |                                                                         |
+------------------+------------+-------------------------------------------------------------------------+
                   |   ↑        |       E1
  +----------------+   |        |       +----------------------+
  |                    |        |       | initial-amout: 100   |
  ↓                    |        |       |                      |
+-+-+---+              |        |       |                      |
|   |   +--------------+        |       +----------------------+
+-+-+---+                       |                  ↑      ↑
  ↓                             |                  |      |
  λ                             |                  |      |
                                |       +---+---+  |      |
                                |       |   |   +--+      |
                                |       +-+-+---+         |
                                |         ↓               |
                                |         λ               |
                                |                         |
                                |                         |
                                |                         |
                                |                         |
                                |       E2                |
                                |       +-----------------+-----+
                                |       | balance: 100          |
                                |       |                       |
                                |       |                       |
                                |       +-----------------------+
                                |                  ↑      ↑
                                |                  |      |
                                |                  |      |
                                |       +---+---+  |      |
                                +------→|   |   +--+      |
                                        +-+-+---+         |
                                          ↓               |
                                          λ               |
                                                          |
                                                          |
                                                          |
                                                          |
                                                          |
                                        E3                |
                                        +-----------------+------+
                                        | amount: 50             |
                                        |                        |
                                        |                        |
                                        +------------------------+
</pre>

<p>
After the evaluation:
</p>

<pre class="example">
GLOBAL ENV
       +---------------------------------------------------------------------------------------------------------+
       | make-withdraw:---+                   w1:---+                                                            |
       |                  |                         |                                                            |
       |                  |                         |                                                            |
       |                  |            +------------+                                                            |
       |                  |            |                                                                         |
       |                  |            |                                                                         |
       +------------------+------------+-------------------------------------------------------------------------+
                          |   ↑        |       E1
         +----------------+   |        |       +----------------------+
         |                    |        |       | initial-amout: 100   |
         ↓                    |        |       |                      |
       +-+-+---+              |        |       |                      |
       |   |   +--------------+        |       +----------------------+
       +-+-+---+                       |                  ↑      ↑
         ↓                             |                  |      |
         λ                             |                  |      |
                                       |       +---+---+  |      |
                                       |       |   |   +--+      |
                                       |       +-+-+---+         |
                                       |         ↓               |
                                       |         λ               |
                                       |                         |
                                       |                         |
                                       |                         |
                                       |                         |
                                       |       E2                |
                                       |       +-----------------+-----+
                                       |       | balance: 50           |
                                       |       |                       |
                                       |       |                       |
                                       |       +-----------------------+
                                       |                  ↑
                                       |                  |
                                       |                  |
                                       |       +---+---+  |
                                       +------→|   |   +--+
                                               +-+-+---+
                                                 ↓
                                                 λ
</pre>

<p>
Evaluating <code>(define w2 (make-withdraw 100))</code>:
</p>

<pre class="example">
GLOBAL ENV
+---------------------------------------------------------------------------------------------------------+
| make-withdraw:---+                   w1:---+                                  w2:---+                   |
|                  |                         |                                        |                   |
|                  |                         |                                        |                   |
|                  |            +------------+                             +----------+                   |
|                  |            |                                          |                              |
|                  |            |                                          |                              |
+------------------+------------+------------------------------------------+------------------------------+
                   |   ↑        |       E1                                 |       E4
  +----------------+   |        |       +----------------------+           |       +----------------------+
  |                    |        |       | initial-amout: 100   |           |       | initial-amout: 100   |
  ↓                    |        |       |                      |           |       |                      |
+-+-+---+              |        |       |                      |           |       |                      |
|   |   +--------------+        |       +----------------------+           |       +----------------------+
+-+-+---+                       |                  ↑      ↑                |                  ↑      ↑
  ↓                             |                  |      |                |                  |      |
  λ                             |                  |      |                |                  |      |
                                |       +---+---+  |      |                |       +---+---+  |      |
                                |       |   |   +--+      |                |       |   |   +--+      |
                                |       +-+-+---+         |                |       +-+-+---+         |
                                |         ↓               |                |         |               |
                                |         λ ←-------------+---------------+---------+                |
                                |                         |                |                         |
                                |                         |                |                         |
                                |                         |                |                         |
                                |                         |                |                         |
                                |       E2                |                |       E5                |
                                |       +-----------------+-----+          |       +-----------------+-----+
                                |       | balance: 50           |          |       | balance: 100          |
                                |       |                       |          |       |                       |
                                |       |                       |          |       |                       |
                                |       +-----------------------+          |       +-----------------------+
                                |                  ↑                       |                  ↑
                                |                  |                       |                  |
                                |                  |                       |                  |
                                |       +---+---+  |                       |       +---+---+  |
                                +------→|   |   +--+                       +------→|   |   +--+
                                        +-+-+---+                                  +-+-+---+
                                          ↓                                        |
                                          λ←-----------------------=---------------+
</pre>

<p>
The environment structures of the two versions of <code>make-withdraw</code>
differ in that the second version creates one frame more than the
first version. That's the frame holding the <code>initial-amount</code> binding.
</p>
</div>
</div>
