blog/24.org
* Exercise 3.11
*Exercise*:

#+begin_quote
In section 3.2.3 we saw how the environment model described the
behavior of procedures with local state.  Now we have seen how
internal definitions work.  A typical message-passing procedure
contains both of these aspects.  Consider the bank account procedure
of section 3.1.1:

 #+begin_src scheme
   (define (make-account balance)
     (define (withdraw amount)
       (if (>= balance amount)
           (begin (set! balance (- balance amount))
                  balance)
           "Insufficient funds"))
     (define (deposit amount)
       (set! balance (+ balance amount))
       balance)
     (define (dispatch m)
       (cond ((eq? m 'withdraw) withdraw)
             ((eq? m 'deposit) deposit)
             (else (error "Unknown request -- MAKE-ACCOUNT"
                          m))))
     dispatch)
#+end_src

 Show the environment structure generated by the sequence of
 interactions

#+begin_src scheme
  (define acc (make-account 50))

  ((acc 'deposit) 40)
  90

  ((acc 'withdraw) 60)
  30
#+end_src

Where is the local state for ~acc~ kept?  Suppose we define another
account

#+begin_src scheme
  (define acc2 (make-account 100))
#+end_src

How are the local states for the two accounts kept distinct?  Which
parts of the environment structure are shared between ~acc~ and
~acc2~?
#+end_quote

*Answer*:

#+begin_src
       global env
       +---------------------------------------------------------------------------------------------------------+
       |  make-account:---+                  acc:-------------------------------------------------------------+  |
       |                  |                                                                                   |  |
       |                  |                                                                                   |  |
       |                  |                                                                                   |  |
       |                  |                                                                                   |  |
       |                  |                                                                                   |  |
       +------------------+-----------------------------------------------------------------------------------+--+
                          |   ↑                                                                               |
         +----------------+   |                                                                               |
         |                    |           +-------------------------------------------------------------+     |
         ↓                    |           | balance: 50  withdraw:.  deposit:.  dispatch:.              |     |
       +---+---+              |           |                       |          |           |              |     |
       |   |   |--------------+           |                       |          |           |              |     |
       +-+-+---+                          |                       | ---------+           |              |     |
         ↓                                |+----------------------+ |                    |              |     |
         λ                                ||                        |                    |              |     |
                                          ||                        |                    |              |     |
                                          ++------------------------+--------------------+---------------     |
                                           | ↑   ↑         ↑        |   |         ↑    ↑ |       ↑            |
                                         +-+ |   |         |        |   |         |    | |       |            |
                                         |   |   |         |        |   |         |    | +--+ +--+------------+
                                         |   |   |         |        |   |         |    |    | |  |
                                         ↓   |   |         |        ↓   |         |    |    ↓ ↓  |
                                       +---+---+ |         |      +---+---+       |    |   +---+---+
                                       |   |   | |         |      |   |   |       |    |   |   |   |
                                       +---+---+ |         |      +---+---+       |    |   +---+---+
                                         ↓       |         |        ↓             |    |     ↓
                                         λ       |         |        λ             |    |     λ
                                                 |         |             +--------+    |
                                                 |         |             |             |
                                      +----------+-------+ |             |  +----------+-------+
                                      |m: 'deposit       | |             |  |amount: 40        |
                                      |                  | |             |  |                  |
                                      |                  | |             |  |                  |
                                      +------------------+ |             |  +------------------+
                                                           |             |
                                                           |             |
                                               +-----------+             +------------+
                                               |                                      |
                                      +--------+---------+                  +---------+--------+
                                      |m: 'withdraw      |                  |amount: 60        |
                                      |                  |                  |                  |
                                      |                  |                  |                  |
                                      +------------------+                  +------------------+
#+end_src

The local state for ~acc~ is kept in the frame created by calling
~make-account~. If we define another account with ~(define acc2
(make-account 100))~, then the local states for the two accounts are
kept distinct, because each call to make-account creates a frame (and
that is the frame where, as we we have seen, we keep the local state
of an account).

~acc~ and ~acc2~ share the text of the procedure objects ~widthdraw~,
~deposit~, and ~dispatch~.
