blog/24.html

<div id="outline-container-org18b7840" class="outline-2">
<h2 id="org18b7840">Exercise 3.11</h2>
<div class="outline-text-2" id="text-org18b7840">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
In section 3.2.3 we saw how the environment model described the
behavior of procedures with local state.  Now we have seen how
internal definitions work.  A typical message-passing procedure
contains both of these aspects.  Consider the bank account procedure
of section 3.1.1:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-account</span> balance)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">withdraw</span> amount)
    (<span style="color: #531ab6;">if</span> (&gt;= balance amount)
        (<span style="color: #531ab6;">begin</span> (set! balance (- balance amount))
               balance)
        <span style="color: #3548cf;">"Insufficient funds"</span>))
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">deposit</span> amount)
    (set! balance (+ balance amount))
    balance)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
    (<span style="color: #531ab6;">cond</span> ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"Unknown request -- MAKE-ACCOUNT"</span>
                       m))))
  dispatch)
</pre>
</div>

<p>
Show the environment structure generated by the sequence of
interactions
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">acc</span> (make-account 50))

((acc 'deposit) 40)
90

((acc 'withdraw) 60)
30
</pre>
</div>

<p>
Where is the local state for <code>acc</code> kept?  Suppose we define another
account
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">acc2</span> (make-account 100))
</pre>
</div>

<p>
How are the local states for the two accounts kept distinct?  Which
parts of the environment structure are shared between <code>acc</code> and
<code>acc2</code>?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<pre class="example">
global env
+---------------------------------------------------------------------------------------------------------+
|  make-account:---+                  acc:-------------------------------------------------------------+  |
|                  |                                                                                   |  |
|                  |                                                                                   |  |
|                  |                                                                                   |  |
|                  |                                                                                   |  |
|                  |                                                                                   |  |
+------------------+-----------------------------------------------------------------------------------+--+
                   |   ↑                                                                               |
  +----------------+   |                                                                               |
  |                    |           +-------------------------------------------------------------+     |
  ↓                    |           | balance: 50  withdraw:.  deposit:.  dispatch:.              |     |
+---+---+              |           |                       |          |           |              |     |
|   |   |--------------+           |                       |          |           |              |     |
+-+-+---+                          |                       | ---------+           |              |     |
  ↓                                |+----------------------+ |                    |              |     |
  λ                                ||                        |                    |              |     |
                                   ||                        |                    |              |     |
                                   ++------------------------+--------------------+---------------     |
                                    | ↑   ↑         ↑        |   |         ↑    ↑ |       ↑            |
                                  +-+ |   |         |        |   |         |    | |       |            |
                                  |   |   |         |        |   |         |    | +--+ +--+------------+
                                  |   |   |         |        |   |         |    |    | |  |
                                  ↓   |   |         |        ↓   |         |    |    ↓ ↓  |
                                +---+---+ |         |      +---+---+       |    |   +---+---+
                                |   |   | |         |      |   |   |       |    |   |   |   |
                                +---+---+ |         |      +---+---+       |    |   +---+---+
                                  ↓       |         |        ↓             |    |     ↓
                                  λ       |         |        λ             |    |     λ
                                          |         |             +--------+    |
                                          |         |             |             |
                               +----------+-------+ |             |  +----------+-------+
                               |m: 'deposit       | |             |  |amount: 40        |
                               |                  | |             |  |                  |
                               |                  | |             |  |                  |
                               +------------------+ |             |  +------------------+
                                                    |             |
                                                    |             |
                                        +-----------+             +------------+
                                        |                                      |
                               +--------+---------+                  +---------+--------+
                               |m: 'withdraw      |                  |amount: 60        |
                               |                  |                  |                  |
                               |                  |                  |                  |
                               +------------------+                  +------------------+
</pre>

<p>
The local state for <code>acc</code> is kept in the frame created by calling
<code>make-account</code>. If we define another account with <code>(define acc2
(make-account 100))</code>, then the local states for the two accounts are
kept distinct, because each call to make-account creates a frame (and
that is the frame where, as we we have seen, we keep the local state
of an account).
</p>

<p>
<code>acc</code> and <code>acc2</code> share the text of the procedure objects <code>widthdraw</code>,
<code>deposit</code>, and <code>dispatch</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</span></p>
</div>
</body>
</html>
